work_machine = File.exists?(File.expand_path("~/.workmachine"))

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "buo/cask-upgrade"
tap "dteoh/sqa"

mas "WiFi Signal", id: 525912054
mas "Deliveries",  id: 290986013

cask "1password"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "datweatherdoe"
cask "istat-menus"
cask "karabiner-elements"
cask "notion"
# cask "slowquitapps"
cask "spotify"
cask "the-unarchiver"
cask "ubersicht"

unless work_machine
  cask "backblaze"
  cask "firefox"
  cask "google-chrome"
  cask "slack"
  cask "zoom"
end

brew "ack"
brew "coreutils"
brew "ctags"
brew "gnu-sed"
brew "graphviz"
brew "grv"
brew "htop"
brew "iftop"
brew "jq"
brew "mas"
brew "rg"
brew "trafshow"
brew "tree"
brew "wget"
