tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "buo/cask-upgrade"
tap "dteoh/sqa"

cask "1password"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "firefox"
cask "font-hack"
cask "google-chrome"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "qmk-toolbox"
cask "slack"
cask "slowquitapps"
cask "spotify"
cask "ubersicht"
cask "visual-studio-code"

brew "ack"
brew "coreutils"
brew "ctags"
brew "gnu-sed"
brew "graphviz"
brew "grv"
brew "htop"
brew "iftop"
brew "jq"
brew "mas"
brew "mtr"
brew "ngrep"
brew "nmap"
brew "p0f"
brew "pinentry-mac"
brew "rg"
brew "trafshow"
brew "tree"
brew "wget"
